# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных позициях. 
# Позиции хранятся в файле file.txt в одной строке одно число.

#try:
#    inpt = input("Введите вещественное число: ")
#    n = int(inpt)
#    
#    multi = 1
#    listOfMulti = []
#    for e in range(1, n + 1):
#        multi *= e
#        listOfMulti.append(multi)
#    
#    print(listOfMulti)
#
#except ValueError:
#    print("Введено не числовое значение")
#