# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.

#try:
#    inpt = input("Введите вещественное число: ")
#    n = int(inpt)
#    
#    multi = 1
#    listOfMulti = []
#    for i, e in range(1, n + 1):
#        multi *= e
#        listOfMulti.append(multi)
#    
#    print(listOfMulti)
#
#except ValueError:
#    print("Введено не числовое значение")
#